# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, SCDownWave, [256]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDownWave, [512]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDownWave, [1024]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [ [2, 4, 6, -1], 1, multiscale_upfusion, [] ]

  - [ [ 1, 2 ], 1, DSIEM, [ 128 ] ]
  - [ [ -1, 11 ], 1, multiscaleConcat, [ 0 ] ] # cat P3 P2
  - [ -1, 3, C2f, [ 128 ] ]  #14

  - [ -1, 1, SCDownWave, [128] ]
  - [ [ -1, 11 ], 1, multiscaleConcat, [ 1 ] ] # cat P3
  - [ -1, 3, C2f, [ 256 ] ]  #17

  - [ -1, 1, SCDownWave, [128] ]
  - [ [ -1, 11 ], 1, multiscaleConcat, [ 2 ] ] # cat head P4
  - [ -1, 3, C2fCIB, [ 512, True ] ] # 20 (P4/16-medium)

  - [ -1, 1, SCDownWave, [128] ]
  - [ [-1, 11], 1, multiscaleConcat, [ 3 ] ] # cat head P5
  - [ -1, 3, C2fCIB, [1024, True] ] # 23 (P5/32-large)

  - [[14, 17, 20, 23], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
